app/Controllers/FotografiaController.php

SELECT *
FROM `fotografias`
---
    public function index(){
        //crear, buscar, seleccionar, editar, eliminar usuarios


       $fotografias =  $this->fotografiaModel->findAll();

SELECT *
FROM `fotografias`
WHERE `fotografias`.`id` = '1'
---
    public function show($id){


        $fotografias = $this->fotografiaModel->find($id);

SELECT *
FROM `fotografias`
WHERE `fotografias`.`id` = '3'
---
    public function edit($id){

        $fotografias = $this->fotografiaModel->find($id);

UPDATE `fotografias` SET `evento_id` = '333333333333333333333333', `url` = 'pokemon.com', `seleccionada` = '1'
WHERE `fotografias`.`id` IN ('1')
---
    public function update($id){


        $data = array(

           "evento_id" => $this->request ->getPost("evento_id"),
            "url" => $this->request ->getPost("url"),
            "seleccionada" => $this->request ->getPost("seleccionada")

        );

        $this->fotografiaModel->update($id,$data);

DELETE FROM `fotografias`
WHERE `id` IN ('3')
---
    public function delete($id){

        $this->fotografiaModel->delete($id);