app/Controllers/UsuarioController.php

SELECT *
FROM `usuarios`
---
    public function index(){
        //crear, buscar, seleccionar, editar, eliminar usuarios


       $usuarios =  $this->usuarioModel->findAll();